---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IndexLine
source: html/47fafd27-2800-e386-fc4e-a43d25d4381f.htm
---
# IndexLine Methods

Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.